Revit 2027 API
PartUtils.HasAssociatedParts(Document, ElementId) Method
 Checks if an element has associated parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasAssociatedParts(
	Document hostDocument,
	ElementId elementId
)
Public Shared Function HasAssociatedParts (
	hostDocument As Document,
	elementId As ElementId
) As Boolean
public:
static bool HasAssociatedParts(
	Document^ hostDocument,
	ElementId^ elementId
)
static member HasAssociatedParts :
        hostDocument : Document *
        elementId : ElementId -> bool
Parameters
hostDocument Document
 The document.
elementId ElementId
 The element to be checked for associated Parts
Return Value
Boolean
 True if the element has associated Parts.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
HasAssociatedParts Overload
Autodesk.Revit.DB Namespace